; domain
(define (domain blocks)

    (:requirements :strips :typing)

    (:types block)

    (:predicates 
        (on ?x - block ?y - block)
        (ontable ?x - block)
        (clear ?x - block)
        (handempty)
        (holding ?x - block)
    )

    (:action pick-up
        :parameters (?x - block)
        :precondition (and (clear ?x) (ontable ?x) (handempty))
        :effect (and (not (ontable ?x)) (not (clear ?x)) (not (handempty)) (holding ?x))
    )

    (:action put-down
        :parameters (?x - block)
        :precondition (holding ?x)
        :effect (and (not (holding ?x)) (clear ?x) (handempty) (ontable ?x))
    )

    (:action stack
        :parameters (?x - block ?y - block)
        :precondition (and (holding ?x) (clear ?y))
        :effect (and (not (holding ?x)) (not (clear ?y)) (clear ?x) (handempty) (on ?x ?y))
    )

    (:action unstack
        :parameters (?x - block ?y - block)
        :precondition (and (on ?x ?y) (clear ?x) (handempty))
        :effect (and (holding ?x) (clear ?y) (not (clear ?x)) (not (handempty)) (not (on ?x ?y)))
    )
)

; problem
(define (problem blocks-20-0)
(:domain blocks)
(:objects r d a f g o i e l j t b q m c k h p n s - block)
(:init (clear s) (clear n) (clear p) (ontable h) (ontable n) (ontable k)
 (on s c) (on c m) (on m q) (on q b) (on b t) (on t j) (on j l) (on l e)
 (on e i) (on i o) (on o g) (on g f) (on f a) (on a d) (on d h) (on p r)
 (on r k) (handempty))
(:goal (and (on k e) (on e n) (on n r) (on r d) (on d g) (on g h) (on h o)
            (on o a) (on a l) (on l j) (on j f) (on f m) (on m i) (on i q)
            (on q b) (on b p) (on p t) (on t s) (on s c)))
)

; plan
1. (unstack p r)
   deleted: (clear p) (handempty) (on p r)
   added: (holding p) (clear r)
   goals met: 2 of 19
2. (put-down p)
   deleted: (holding p)
   added: (clear p) (handempty) (ontable p)
   goals met: 2 of 19
3. (unstack r k)
   deleted: (clear r) (handempty) (on r k)
   added: (holding r) (clear k)
   goals met: 2 of 19
4. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 2 of 19
5. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 2 of 19
6. (stack n r)
   deleted: (holding n) (clear r)
   added: (clear n) (handempty) (on n r)
   goals met: 3 of 19
7. (unstack s c)
   deleted: (clear s) (handempty) (on s c)
   added: (holding s) (clear c)
   goals met: 2 of 19
8. (put-down s)
   deleted: (holding s)
   added: (clear s) (handempty) (ontable s)
   goals met: 2 of 19
9. (unstack c m)
   deleted: (clear c) (handempty) (on c m)
   added: (holding c) (clear m)
   goals met: 2 of 19
10. (put-down c)
   deleted: (holding c)
   added: (clear c) (handempty) (ontable c)
   goals met: 2 of 19
11. (unstack m q)
   deleted: (clear m) (handempty) (on m q)
   added: (holding m) (clear q)
   goals met: 2 of 19
12. (put-down m)
   deleted: (holding m)
   added: (clear m) (handempty) (ontable m)
   goals met: 2 of 19
13. (unstack q b)
   deleted: (clear q) (handempty) (on q b)
   added: (holding q) (clear b)
   goals met: 1 of 19
14. (put-down q)
   deleted: (holding q)
   added: (clear q) (handempty) (ontable q)
   goals met: 1 of 19
15. (unstack b t)
   deleted: (clear b) (handempty) (on b t)
   added: (holding b) (clear t)
   goals met: 1 of 19
16. (stack b p)
   deleted: (holding b) (clear p)
   added: (clear b) (handempty) (on b p)
   goals met: 2 of 19
17. (unstack t j)
   deleted: (clear t) (handempty) (on t j)
   added: (holding t) (clear j)
   goals met: 2 of 19
18. (stack t s)
   deleted: (holding t) (clear s)
   added: (clear t) (handempty) (on t s)
   goals met: 3 of 19
19. (unstack j l)
   deleted: (clear j) (handempty) (on j l)
   added: (holding j) (clear l)
   goals met: 3 of 19
20. (put-down j)
   deleted: (holding j)
   added: (clear j) (handempty) (ontable j)
   goals met: 3 of 19
21. (unstack l e)
   deleted: (clear l) (handempty) (on l e)
   added: (holding l) (clear e)
   goals met: 3 of 19
22. (stack l j)
   deleted: (holding l) (clear j)
   added: (clear l) (handempty) (on l j)
   goals met: 4 of 19
23. (unstack e i)
   deleted: (clear e) (handempty) (on e i)
   added: (holding e) (clear i)
   goals met: 4 of 19
24. (stack e n)
   deleted: (holding e) (clear n)
   added: (clear e) (handempty) (on e n)
   goals met: 5 of 19
25. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 5 of 19
26. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 6 of 19
27. (unstack i o)
   deleted: (clear i) (handempty) (on i o)
   added: (holding i) (clear o)
   goals met: 6 of 19
28. (stack i q)
   deleted: (holding i) (clear q)
   added: (clear i) (handempty) (on i q)
   goals met: 7 of 19
29. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 7 of 19
30. (stack m i)
   deleted: (holding m) (clear i)
   added: (clear m) (handempty) (on m i)
   goals met: 8 of 19
31. (unstack o g)
   deleted: (clear o) (handempty) (on o g)
   added: (holding o) (clear g)
   goals met: 8 of 19
32. (put-down o)
   deleted: (holding o)
   added: (clear o) (handempty) (ontable o)
   goals met: 8 of 19
33. (unstack g f)
   deleted: (clear g) (handempty) (on g f)
   added: (holding g) (clear f)
   goals met: 8 of 19
34. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 8 of 19
35. (unstack f a)
   deleted: (clear f) (handempty) (on f a)
   added: (holding f) (clear a)
   goals met: 8 of 19
36. (stack f m)
   deleted: (holding f) (clear m)
   added: (clear f) (handempty) (on f m)
   goals met: 9 of 19
37. (unstack a d)
   deleted: (clear a) (handempty) (on a d)
   added: (holding a) (clear d)
   goals met: 9 of 19
38. (stack a l)
   deleted: (holding a) (clear l)
   added: (clear a) (handempty) (on a l)
   goals met: 10 of 19
39. (unstack d h)
   deleted: (clear d) (handempty) (on d h)
   added: (holding d) (clear h)
   goals met: 10 of 19
40. (stack d g)
   deleted: (holding d) (clear g)
   added: (clear d) (handempty) (on d g)
   goals met: 11 of 19
41. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 11 of 19
42. (stack o a)
   deleted: (holding o) (clear a)
   added: (clear o) (handempty) (on o a)
   goals met: 12 of 19
43. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 12 of 19
44. (stack h o)
   deleted: (holding h) (clear o)
   added: (clear h) (handempty) (on h o)
   goals met: 13 of 19
45. (unstack b p)
   deleted: (clear b) (handempty) (on b p)
   added: (holding b) (clear p)
   goals met: 12 of 19
46. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 12 of 19
47. (pick-up p)
   deleted: (ontable p) (clear p) (handempty)
   added: (holding p)
   goals met: 12 of 19
48. (stack p t)
   deleted: (holding p) (clear t)
   added: (clear p) (handempty) (on p t)
   goals met: 13 of 19
49. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 13 of 19
50. (stack b p)
   deleted: (holding b) (clear p)
   added: (clear b) (handempty) (on b p)
   goals met: 14 of 19
51. (unstack d g)
   deleted: (clear d) (handempty) (on d g)
   added: (holding d) (clear g)
   goals met: 13 of 19
52. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 13 of 19
53. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 13 of 19
54. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 14 of 19
55. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 14 of 19
56. (stack d g)
   deleted: (holding d) (clear g)
   added: (clear d) (handempty) (on d g)
   goals met: 15 of 19
57. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 14 of 19
58. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 14 of 19
59. (unstack e n)
   deleted: (clear e) (handempty) (on e n)
   added: (holding e) (clear n)
   goals met: 13 of 19
60. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 13 of 19
61. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 13 of 19
62. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 14 of 19
63. (unstack n r)
   deleted: (clear n) (handempty) (on n r)
   added: (holding n) (clear r)
   goals met: 13 of 19
64. (put-down n)
   deleted: (holding n)
   added: (clear n) (handempty) (ontable n)
   goals met: 13 of 19
65. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 13 of 19
66. (stack r d)
   deleted: (holding r) (clear d)
   added: (clear r) (handempty) (on r d)
   goals met: 14 of 19
67. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 14 of 19
68. (stack n r)
   deleted: (holding n) (clear r)
   added: (clear n) (handempty) (on n r)
   goals met: 15 of 19
69. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 14 of 19
70. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 14 of 19
71. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 14 of 19
72. (stack e n)
   deleted: (holding e) (clear n)
   added: (clear e) (handempty) (on e n)
   goals met: 15 of 19
73. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 15 of 19
74. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 16 of 19
75. (unstack b p)
   deleted: (clear b) (handempty) (on b p)
   added: (holding b) (clear p)
   goals met: 15 of 19
76. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 15 of 19
77. (unstack p t)
   deleted: (clear p) (handempty) (on p t)
   added: (holding p) (clear t)
   goals met: 14 of 19
78. (put-down p)
   deleted: (holding p)
   added: (clear p) (handempty) (ontable p)
   goals met: 14 of 19
79. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 14 of 19
80. (stack b p)
   deleted: (holding b) (clear p)
   added: (clear b) (handempty) (on b p)
   goals met: 15 of 19
81. (unstack t s)
   deleted: (clear t) (handempty) (on t s)
   added: (holding t) (clear s)
   goals met: 14 of 19
82. (put-down t)
   deleted: (holding t)
   added: (clear t) (handempty) (ontable t)
   goals met: 14 of 19
83. (pick-up s)
   deleted: (ontable s) (clear s) (handempty)
   added: (holding s)
   goals met: 14 of 19
84. (stack s c)
   deleted: (holding s) (clear c)
   added: (clear s) (handempty) (on s c)
   goals met: 15 of 19
85. (pick-up t)
   deleted: (ontable t) (clear t) (handempty)
   added: (holding t)
   goals met: 15 of 19
86. (stack t s)
   deleted: (holding t) (clear s)
   added: (clear t) (handempty) (on t s)
   goals met: 16 of 19
87. (unstack b p)
   deleted: (clear b) (handempty) (on b p)
   added: (holding b) (clear p)
   goals met: 15 of 19
88. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 15 of 19
89. (pick-up p)
   deleted: (ontable p) (clear p) (handempty)
   added: (holding p)
   goals met: 15 of 19
90. (stack p t)
   deleted: (holding p) (clear t)
   added: (clear p) (handempty) (on p t)
   goals met: 16 of 19
91. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 16 of 19
92. (stack b p)
   deleted: (holding b) (clear p)
   added: (clear b) (handempty) (on b p)
   goals met: 17 of 19
93. (unstack f m)
   deleted: (clear f) (handempty) (on f m)
   added: (holding f) (clear m)
   goals met: 16 of 19
94. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 16 of 19
95. (unstack m i)
   deleted: (clear m) (handempty) (on m i)
   added: (holding m) (clear i)
   goals met: 15 of 19
96. (put-down m)
   deleted: (holding m)
   added: (clear m) (handempty) (ontable m)
   goals met: 15 of 19
97. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 15 of 19
98. (stack f m)
   deleted: (holding f) (clear m)
   added: (clear f) (handempty) (on f m)
   goals met: 16 of 19
99. (unstack i q)
   deleted: (clear i) (handempty) (on i q)
   added: (holding i) (clear q)
   goals met: 15 of 19
100. (put-down i)
   deleted: (holding i)
   added: (clear i) (handempty) (ontable i)
   goals met: 15 of 19
101. (pick-up q)
   deleted: (ontable q) (clear q) (handempty)
   added: (holding q)
   goals met: 15 of 19
102. (stack q b)
   deleted: (holding q) (clear b)
   added: (clear q) (handempty) (on q b)
   goals met: 16 of 19
103. (pick-up i)
   deleted: (ontable i) (clear i) (handempty)
   added: (holding i)
   goals met: 16 of 19
104. (stack i q)
   deleted: (holding i) (clear q)
   added: (clear i) (handempty) (on i q)
   goals met: 17 of 19
105. (unstack f m)
   deleted: (clear f) (handempty) (on f m)
   added: (holding f) (clear m)
   goals met: 16 of 19
106. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 16 of 19
107. (pick-up m)
   deleted: (ontable m) (clear m) (handempty)
   added: (holding m)
   goals met: 16 of 19
108. (stack m i)
   deleted: (holding m) (clear i)
   added: (clear m) (handempty) (on m i)
   goals met: 17 of 19
109. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 17 of 19
110. (stack f m)
   deleted: (holding f) (clear m)
   added: (clear f) (handempty) (on f m)
   goals met: 18 of 19
111. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 17 of 19
112. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 17 of 19
113. (unstack e n)
   deleted: (clear e) (handempty) (on e n)
   added: (holding e) (clear n)
   goals met: 16 of 19
114. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 16 of 19
115. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 16 of 19
116. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 17 of 19
117. (unstack n r)
   deleted: (clear n) (handempty) (on n r)
   added: (holding n) (clear r)
   goals met: 16 of 19
118. (put-down n)
   deleted: (holding n)
   added: (clear n) (handempty) (ontable n)
   goals met: 16 of 19
119. (unstack r d)
   deleted: (clear r) (handempty) (on r d)
   added: (holding r) (clear d)
   goals met: 15 of 19
120. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 15 of 19
121. (unstack d g)
   deleted: (clear d) (handempty) (on d g)
   added: (holding d) (clear g)
   goals met: 14 of 19
122. (put-down d)
   deleted: (holding d)
   added: (clear d) (handempty) (ontable d)
   goals met: 14 of 19
123. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 14 of 19
124. (stack r d)
   deleted: (holding r) (clear d)
   added: (clear r) (handempty) (on r d)
   goals met: 15 of 19
125. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 15 of 19
126. (stack n r)
   deleted: (holding n) (clear r)
   added: (clear n) (handempty) (on n r)
   goals met: 16 of 19
127. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 15 of 19
128. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 15 of 19
129. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 15 of 19
130. (stack e n)
   deleted: (holding e) (clear n)
   added: (clear e) (handempty) (on e n)
   goals met: 16 of 19
131. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 16 of 19
132. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 17 of 19
133. (unstack g h)
   deleted: (clear g) (handempty) (on g h)
   added: (holding g) (clear h)
   goals met: 16 of 19
134. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 16 of 19
135. (unstack h o)
   deleted: (clear h) (handempty) (on h o)
   added: (holding h) (clear o)
   goals met: 15 of 19
136. (put-down h)
   deleted: (holding h)
   added: (clear h) (handempty) (ontable h)
   goals met: 15 of 19
137. (unstack o a)
   deleted: (clear o) (handempty) (on o a)
   added: (holding o) (clear a)
   goals met: 14 of 19
138. (put-down o)
   deleted: (holding o)
   added: (clear o) (handempty) (ontable o)
   goals met: 14 of 19
139. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 14 of 19
140. (stack h o)
   deleted: (holding h) (clear o)
   added: (clear h) (handempty) (on h o)
   goals met: 15 of 19
141. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 15 of 19
142. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 16 of 19
143. (unstack a l)
   deleted: (clear a) (handempty) (on a l)
   added: (holding a) (clear l)
   goals met: 15 of 19
144. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 15 of 19
145. (unstack l j)
   deleted: (clear l) (handempty) (on l j)
   added: (holding l) (clear j)
   goals met: 14 of 19
146. (put-down l)
   deleted: (holding l)
   added: (clear l) (handempty) (ontable l)
   goals met: 14 of 19
147. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 14 of 19
148. (stack j f)
   deleted: (holding j) (clear f)
   added: (clear j) (handempty) (on j f)
   goals met: 15 of 19
149. (pick-up l)
   deleted: (ontable l) (clear l) (handempty)
   added: (holding l)
   goals met: 15 of 19
150. (stack l j)
   deleted: (holding l) (clear j)
   added: (clear l) (handempty) (on l j)
   goals met: 16 of 19
151. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 16 of 19
152. (stack a l)
   deleted: (holding a) (clear l)
   added: (clear a) (handempty) (on a l)
   goals met: 17 of 19
153. (unstack g h)
   deleted: (clear g) (handempty) (on g h)
   added: (holding g) (clear h)
   goals met: 16 of 19
154. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 16 of 19
155. (unstack h o)
   deleted: (clear h) (handempty) (on h o)
   added: (holding h) (clear o)
   goals met: 15 of 19
156. (put-down h)
   deleted: (holding h)
   added: (clear h) (handempty) (ontable h)
   goals met: 15 of 19
157. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 15 of 19
158. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 16 of 19
159. (pick-up o)
   deleted: (ontable o) (clear o) (handempty)
   added: (holding o)
   goals met: 16 of 19
160. (stack o a)
   deleted: (holding o) (clear a)
   added: (clear o) (handempty) (on o a)
   goals met: 17 of 19
161. (unstack g h)
   deleted: (clear g) (handempty) (on g h)
   added: (holding g) (clear h)
   goals met: 16 of 19
162. (put-down g)
   deleted: (holding g)
   added: (clear g) (handempty) (ontable g)
   goals met: 16 of 19
163. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 16 of 19
164. (stack h o)
   deleted: (holding h) (clear o)
   added: (clear h) (handempty) (on h o)
   goals met: 17 of 19
165. (pick-up g)
   deleted: (ontable g) (clear g) (handempty)
   added: (holding g)
   goals met: 17 of 19
166. (stack g h)
   deleted: (holding g) (clear h)
   added: (clear g) (handempty) (on g h)
   goals met: 18 of 19
167. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 17 of 19
168. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 17 of 19
169. (unstack e n)
   deleted: (clear e) (handempty) (on e n)
   added: (holding e) (clear n)
   goals met: 16 of 19
170. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 16 of 19
171. (unstack n r)
   deleted: (clear n) (handempty) (on n r)
   added: (holding n) (clear r)
   goals met: 15 of 19
172. (put-down n)
   deleted: (holding n)
   added: (clear n) (handempty) (ontable n)
   goals met: 15 of 19
173. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 15 of 19
174. (stack e n)
   deleted: (holding e) (clear n)
   added: (clear e) (handempty) (on e n)
   goals met: 16 of 19
175. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 16 of 19
176. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 17 of 19
177. (unstack r d)
   deleted: (clear r) (handempty) (on r d)
   added: (holding r) (clear d)
   goals met: 16 of 19
178. (put-down r)
   deleted: (holding r)
   added: (clear r) (handempty) (ontable r)
   goals met: 16 of 19
179. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 16 of 19
180. (stack d g)
   deleted: (holding d) (clear g)
   added: (clear d) (handempty) (on d g)
   goals met: 17 of 19
181. (pick-up r)
   deleted: (ontable r) (clear r) (handempty)
   added: (holding r)
   goals met: 17 of 19
182. (stack r d)
   deleted: (holding r) (clear d)
   added: (clear r) (handempty) (on r d)
   goals met: 18 of 19
183. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 17 of 19
184. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 17 of 19
185. (unstack e n)
   deleted: (clear e) (handempty) (on e n)
   added: (holding e) (clear n)
   goals met: 16 of 19
186. (put-down e)
   deleted: (holding e)
   added: (clear e) (handempty) (ontable e)
   goals met: 16 of 19
187. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 16 of 19
188. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 17 of 19
189. (pick-up n)
   deleted: (ontable n) (clear n) (handempty)
   added: (holding n)
   goals met: 17 of 19
190. (stack n r)
   deleted: (holding n) (clear r)
   added: (clear n) (handempty) (on n r)
   goals met: 18 of 19
191. (unstack k e)
   deleted: (clear k) (handempty) (on k e)
   added: (holding k) (clear e)
   goals met: 17 of 19
192. (put-down k)
   deleted: (holding k)
   added: (clear k) (handempty) (ontable k)
   goals met: 17 of 19
193. (pick-up e)
   deleted: (ontable e) (clear e) (handempty)
   added: (holding e)
   goals met: 17 of 19
194. (stack e n)
   deleted: (holding e) (clear n)
   added: (clear e) (handempty) (on e n)
   goals met: 18 of 19
195. (pick-up k)
   deleted: (ontable k) (clear k) (handempty)
   added: (holding k)
   goals met: 18 of 19
196. (stack k e)
   deleted: (holding k) (clear e)
   added: (clear k) (handempty) (on k e)
   goals met: 19 of 19
